/*** ######## Quran #### */

let quranA=[
    [
  {
    "name": "حرم الإسلام الممارسة الجنسية القائمة على مخالفة الشرع.",
    "true": "ص",
    "false": "d",
    "Answer": "ص",
    "unit": "1",
    "index": 1
  },
  {
    "name": "يخرج الزاني عن الإيمان حال ارتكابه لجريمة الزنى.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 2
  },
  {
    "name": "يتصف الزاني بانعدام الإحساس وسوء الخلق.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 3
  },
  {
    "name": "من آثار الزنى في حياة الفرد تهدم الأسرة واضطرابها.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 4
  },
  {
    "name": "خص الرجال بالذكر لأنهم أكثر تعرضًا لتهمة الزنى. (في سياق آيات اللعان والقذف)",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 5
  },
  {
    "name": "تكون عقوبة القاذف واحدة في حال صدقه أو كذبه عند عجزه عن البيّنة.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 6
  },
  {
    "name": "تفضل الله تعالى على المؤمنين بتشريع الأحكام.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 7
  },
  {
    "name": "يمكن للقاذف العودة لوضعه الطبيعي في المجتمع إذا تاب وبرأ الشخص الذي قذفه.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 8
  },
  {
    "name": "يحمي حد القذف المجتمع من إثارة الشهوات وانتشار الكلام في الأعراض.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 9
  },
  {
    "name": "أحكام القذف تساعد على الحد من إطلاق الألسنة بالتهم الكاذبة.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 10
  },{
    "name": "سورة النور سورة مدنية.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 11
  },
  {
    "name": "الزانية والزاني يُجلدان مائة جلدة بنص سورة النور.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 12
  },
  {
    "name": "يُشترط وجود أربعة شهداء لإثبات جريمة الزنا كما ذكرت سورة النور.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 13
  },
  {
    "name": "سورة النور ذكرت حكم القذف وأن عقوبته خمسون جلدة.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 14
  },
  {
    "name": "من يقذف المحصنات المؤمنات يُحكم عليه بثمانين جلدة.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 15
  },
  {
    "name": "الذين قُذفوا في حادثة الإفك هم المنافقون.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 16
  },
  {
    "name": "حادثة الإفك كانت ابتلاءً للمؤمنين وفيها خير لهم كما قالت الآيات.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 17
  },
  {
    "name": "سورة النور وصفت إشاعة الأخبار المكذوبة بأنها خير للمؤمنين.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 18
  },
  {
    "name": "سورة النور تأمر المؤمنين بحسن الظن عند سماع الإفك.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 19
  },
  {
    "name": "من يشارك في نشر الإفك له عذاب عظيم بنص سورة النور.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 20
  }
],[
  {
    "name": "قال الله تعالى: {وَأَنزَلْنَا فِيهَا آيَاتٍ بَيِّنَاتٍ لَّعَلَّكُمْ ...} (النور: 46)",
    "select1": "تفلحون",
    "select2": "تتقون",
    "select3": "تذكرون",
    "select4": "تعملون",
    "Answer": "تذكرون",
    "unit": "1",
    "index": 1
  },
  {
    "name": "قال الله تعالى: {وَلا تَأْخُذْكُمْ بِهِمَا رَأْفَةٌ فِي دِينِ اللَّهِ إِنْ كُنتُمْ ...} (النور: 2)",
    "select1": "تؤمنون بالله",
    "select2": "تعلمون",
    "select3": "بآياته مؤمنين",
    "select4": "إياه تعبدون",
    "Answer": "تؤمنون بالله",
    "unit": "1",
    "index": 2
  },
  {
    "name": "قال الله تعالى: {وَلا تَقْبَلُوا لَهُمْ شَهَادَةً أَبَداً وَأُوْلَئِكَ هُمْ ...} (النور: 4)",
    "select1": "الظالمون",
    "select2": "الضالون",
    "select3": "المعتدون",
    "select4": "الفاسقون",
    "Answer": "الفاسقون",
    "unit": "1",
    "index": 3
  },
  {
    "name": "قال الله تعالى: {وَأَنَّ اللَّهَ ...} خُتمت آيات القذف واللعان بقوله تعالى ...",
    "select1": "غفور رحيم",
    "select2": "شديد العذاب",
    "select3": "تواب حكيم",
    "select4": "بكل شيئ عليم",
    "Answer": "تواب حكيم",
    "unit": "1",
    "index": 4
  },
  {
    "name": "قال الله تعالى: {وَلَوْلا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ وَأَنَّ اللَّهَ ... حَكِيمٌ}",
    "select1": "عليم",
    "select2": "لَعَلِّي",
    "select3": "عزيز",
    "select4": "تواب",
    "Answer": "تواب",
    "unit": "1",
    "index": 5
  },
  {
    "name": "قال الله تعالى: {لِكُلِّ امْرِئٍ مِّنْهُم مَّا اكْتَسَبَ مِنَ الإِثْمِ وَالَّذِي تَوَلَّى كِبْرَهُ مِنْهُمْ لَهُ عَذَابٌ ...} (النور: 11)",
    "select1": "مُهِين",
    "select2": "عَظِيم",
    "select3": "أَلِيم",
    "select4": "شَدِيد",
    "Answer": "عَظِيم",
    "unit": "1",
    "index": 6
  },
  {
    "name": "قال الله تعالى: {إِنَّ الَّذِينَ ... لَهُمْ عَذَابٌ أَلِيمٌ} (النور: 19) (الآية كاملة)",
    "select1": "كفروا وماتوا وهم كفار",
    "select2": "يرمون المحصنات الغافلات",
    "select3": "لا يؤمنون بآيات الله",
    "select4": "يحبون أن تشيع الفاحشة في الذين آمنوا",
    "Answer": "يحبون أن تشيع الفاحشة في الذين آمنوا",
    "unit": "1",
    "index": 7
  },
  {
    "name": "قال الله تعالى: {يَعِظُكُمُ اللَّهُ أَن تَعُودُوا لِمِثْلِهِ أَبَداً إِن كُنتُم ...}",
    "select1": "صابرين",
    "select2": "صادقين",
    "select3": "موقنين",
    "select4": "مؤمنين",
    "Answer": "مؤمنين",
    "unit": "1",
    "index": 8
  },
  {
    "name": "خُتمت الآية التي ورد فيها التحذير من مكائد الشيطان بقوله تعالى ... (النور: 21)",
    "select1": "سميع عليم",
    "select2": "غفور رحيم",
    "select3": "عليم حكيم",
    "select4": "خبير بصير",
    "Answer": "سميع عليم",
    "unit": "1",
    "index": 9
  },
  {
    "name": "خُتمت هذه الآية بقوله تعالى ... (وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ)",
    "select1": "والله غفور رحيم",
    "select2": "إن الله غفور رحيم",
    "select3": "وهو الغفور الرحيم",
    "select4": "الله هو الغفور الرحيم",
    "Answer": "إن الله غفور رحيم",
    "unit": "1",
    "index": 10
  },
  {
    "name": "قال الله تعالى: {وَيَعْلَمُ أَنَّ اللَّهَ هُوَ ...} (النور: 25)",
    "select1": "الخلاق العليم",
    "select2": "الحق المبين",
    "select3": "التواب الرحيم",
    "select4": "الرحمن الرحيم",
    "Answer": "الحق المبين",
    "unit": "1",
    "index": 11
  },
  {
    "name": "الآية التي قبل هذه الآية بدأت بقوله تعالى ... (النور: 30) {وَقُل لِّلْمُؤْمِنَاتِ يَغْضُضْنَ مِنْ أَبْصَارِهِنَّ وَيَحْفَظْنَ فُرُوجَهُنَّ ...}",
    "select1": "ليس عليكم جناح",
    "select2": "قل للمؤمنين يغضوا من أبصارهم",
    "select3": "ولقد أنزلنا إليكم",
    "select4": "قل للمؤمنين يمضوا",
    "Answer": "قل للمؤمنين يغضوا من أبصارهم",
    "unit": "1",
    "index": 12
  },
  {
    "name": "قال الله تعالى: {... يَنفَعُكُمْ بِيُضَاعِفْهُ لَكُمْ وَيَغْفِرْ لَكُمْ وَاللَّهُ شَكُورٌ حَلِيمٌ}",
    "select1": "يُغْنِهِمُ",
    "select2": "بِفَضْلِهِ وَاللَّهُ",
    "select3": "عَلِيم",
    "select4": "وَاسِع",
    "Answer": "بِفَضْلِهِ وَاللَّهُ",
    "unit": "1",
    "index": 13
  },
  {
    "name": "قال الله تعالى: {يَغْنِهِمُ اللَّهُ مِن فَضْلِهِ وَاللَّهُ ... عَلِيمٌ} (النور: 32)",
    "select1": "سميع",
    "select2": "واسع",
    "select3": "حكيم",
    "select4": "شاكر",
    "Answer": "واسع",
    "unit": "1",
    "index": 14
  },
  {
    "name": "قال الله تعالى: {وَيَضْرِبُ اللَّهُ الأَمْثَالَ لِلنَّاسِ وَاللَّهُ بِكُلِّ شَيْءٍ ...} (النور: 35)",
    "select1": "محيط",
    "select2": "بصير",
    "select3": "قدير",
    "select4": "عليم",
    "Answer": "عليم",
    "unit": "1",
    "index": 15
  },
  {
    "name": "قال الله تعالى: {وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالأَرْضِ وَإِلَى اللَّهِ الْمَصِيرُ} بداية الآية التي قبلها بقوله تعالى ... (النور: 42)",
    "select1": "أَلَمْ تَرَ أَنَّ اللَّهَ يُزْجِي سَحَابًا",
    "select2": "أَلَمْ تَرَ أَنَّ اللَّهَ يُسَبِّحُ لَهُ مَن فِي السَّمَاوَاتِ وَالأَرْضِ",
    "select3": "اللَّهُ نُورُ السَّمَاوَاتِ وَالأَرْضِ",
    "select4": "وَلَا تُمْسِكُوا بِعِصَمِ الْكَوَافِرِ",
    "Answer": "أَلَمْ تَرَ أَنَّ اللَّهَ يُسَبِّحُ لَهُ مَن فِي السَّمَاوَاتِ وَالأَرْضِ",
    "unit": "1",
    "index": 16
  },
  {
    "name": "قال الله تعالى: {وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالأَرْضِ وَإِلَى اللَّهِ ...} (النور: 42)",
    "select1": "تُرْجَعُ الْأُمُورُ",
    "select2": "تَصِيرُ الْأُمُورُ",
    "select3": "تُحْشَرُون",
    "select4": "الْمَصِير",
    "Answer": "الْمَصِير",
    "unit": "1",
    "index": 17
  },
  {
    "name": "قال الله تعالى: {قُلْ أَطِيعُوا اللَّهَ ... فَإِن تَوَلَّوْا فَإِنَّمَا عَلَيْهِ مَا حُمِّلَ} (النور: 54)",
    "select1": "وَالرَّسُول",
    "select2": "وَرَسُولَهُ",
    "select3": "وَأُولِي الْأَمْر",
    "select4": "وَأَطِيعُوا الرَّسُول",
    "Answer": "وَالرَّسُول",
    "unit": "1",
    "index": 18
  },
  {
    "name": "قال الله تعالى: {وَأَطِيعُوا الرَّسُولَ لَعَلَّكُمْ ...} (النور: 54)",
    "select1": "تُفْلِحُون",
    "select2": "تُرْحَمُون",
    "select3": "تَهْتَدُون",
    "select4": "تَشْكُرُون",
    "Answer": "تُرْحَمُون",
    "unit": "1",
    "index": 19
  },
  {
    "name": "التوبة تؤدي إلى التغيير الداخلي لـ ...",
    "select1": "النوايا",
    "select2": "القلوب",
    "select3": "المشاعر",
    "select4": "الإيمان",
    "Answer": "القلوب",
    "unit": "1",
    "index": 20
  },
  {
    "name": "قال الله تعالى: {يَعِظُكُمُ اللَّهُ} معنى {يَعِظُكُمُ}:",
    "select1": "يُخْبِرُكُم",
    "select2": "يُرْشِدُكُم",
    "select3": "يُحْذِرُكُم",
    "select4": "يَنصَحُكُم",
    "Answer": "يَنصَحُكُم",
    "unit": "1",
    "index": 21
  },
  {
    "name": "قال الله تعالى: {وَالْخَبِيثَاتُ لِلْخَبِيثِينَ} المراد بالأموال والأفعال الطيبة تتناسب مع ...",
    "select1": "الصادقين",
    "select2": "الخبيثين",
    "select3": "المذنبين",
    "select4": "الطيبين",
    "Answer": "الطيبين",
    "unit": "1",
    "index": 22
  },
  {
    "name": "قال الله تعالى: {وَقُل لِّلْمُؤْمِنَاتِ يَدْنِينَ عَلَيْهِنَّ مِن جَلابِيبِهِنَّ} من محارم المرأة غير المذكور في آية سورة النور ...",
    "select1": "العم",
    "select2": "ابن الأخت",
    "select3": "ابن الأخ",
    "select4": "ابن العم",
    "Answer": "ابن العم",
    "unit": "1",
    "index": 23
  },
  {
    "name": "تحقق الحشمة للمرأة بـ ...",
    "select1": "مخاصرة نفسها",
    "select2": "ترك التزين",
    "select3": "التمتع بالمسموح به",
    "select4": "التغطية",
    "Answer": "التغطية",
    "unit": "1",
    "index": 24
  },
  {
    "name": "قال الله تعالى: {وَلا يَضْرِبْنَ بِأَرْجُلِهِنَّ} القاعدة المستنبطة من الآية تفيد منع ...",
    "select1": "لبس الخلخال",
    "select2": "ما يلفت الانتباه",
    "select3": "سرعة المشي",
    "select4": "الزينة الظاهرة",
    "Answer": "ما يلفت الانتباه",
    "unit": "1",
    "index": 25
  },
  {
    "name": "الاستمتاع بالمرأة مقابل أجر وبدون ضوابط شرعية يسمى ...",
    "select1": "ملك اليمين",
    "select2": "زواج",
    "select3": "زنى",
    "select4": "بغاء",
    "Answer": "بغاء",
    "unit": "1",
    "index": 26
  },
  {
    "name": "من مظاهر التعاون في حياة المؤمنين ...",
    "select1": "جهاد",
    "select2": "الحمة بالمساكين",
    "select3": "حب الآخرين",
    "select4": "الإنفاق",
    "Answer": "الإنفاق",
    "unit": "1",
    "index": 27
  },
  {
    "name": "التوبة تؤدي إلى التغيير الداخلي لـ ...",
    "select1": "النوايا",
    "select2": "القلوب",
    "select3": "المشاعر",
    "select4": "الإيمان",
    "Answer": "القلوب",
    "unit": "1",
    "index": 28
  },
  {
    "name": "تحقق الحشمة للمرأة بـ ...",
    "select1": "مخاصرة نفسها",
    "select2": "ترك التزين",
    "select3": "التمتع بالمسموح به",
    "select4": "التغطية",
    "Answer": "التغطية",
    "unit": "1",
    "index": 29
  },{
    "name": "قال الله تعالى: {وَيَعْلَمُ أَنَّ اللَّهَ هُوَ ...} (النور: 25)",
    "select1": "الخلاق العليم",
    "select2": "الحق المبين",
    "select3": "التواب الرحيم",
    "select4": "الرحمن الرحيم",
    "Answer": "الحق المبين",
    "unit": "1",
    "index": 30
  },
]
]
  
/// ###### Isalma
let islamicA =[[
  {
    "name": "إيمان الإنسان بالعقاب الإلهي يجعله متنبهاً لتصرفاته وأعماله",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 1
  },
  {
    "name": "جعل الله في تشريعه عقوبات عاجلة محددة لجميع الذنوب والمعاصي.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 2
  },
  {
    "name": "القصاص في القتل العمد عامل ردع للقاتل دون غيره",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 3
  },
  {
    "name": "العقوبات الإلهية على كثير من الجرائم تمثل رادعاً لجميع الناس وضابطاً لهم",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 4
  },
  {
    "name": "العقوبات الإلهية على كثير من الجرائم تمثل رادعاً لكثير من الناس وضابطاً لهم",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 5
  },
  {
    "name": "التقت جميع الكتائب مع كتيبة رسول الله صلى الله عليه وسلم في (ذي طوى)",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 6
  },
  {
    "name": "دخول رسول الله صلى الله عليه وآله وسلم مكة مظفراً راجع تواضعاً لله تعالى",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 7
  },
  {
    "name": "عند دخول رسول الله الى المسجد الحرام استلم الركن اليماني",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 8
  },
  {
    "name": "الطواف بالبيت الحرام، أول عمل قام به رسول الله صلى الله عليه وسلم بعد الفتح",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 9
  },
  {
    "name": "كسر النبي صلى الله عليه وسلم الأصنام التي حول الكعبة أثناء طوافه",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 10
  },
  {
    "name": "تعدد المسؤوليات يعني انفصالها عن بعضها",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 11
  },
  {
    "name": "انطلاق الفرد بمسؤوليته الفردية، وتفاعله في المسؤولية الجماعية يؤكد تكامل المسؤوليات",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 12
  },
  {
    "name": "إقامة القسط من الجوانب العملية المندرجة ضمن المسؤوليات الجماعية",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 13
  },
  {
    "name": "من أهم المسؤوليات الجماعية سعي كل فرد في الأمة لإقامة القسط",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 14
  },
  {
    "name": "التحرك الحقيقي بالأمر بالمعروف والنهي عن المنكر يحقق خيرية الأمة",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 15
  },
  {
    "name": "يعد الصبر من العوامل المساعدة على الاستقامة",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 16
  },
  {
    "name": "الصبر أمام الشهوات والرغبات والإغراءات عامل يقي من الانحراف",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 17
  },
  {
    "name": "في كل الأحوال يحتاج الإنسان إلى الصبر",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 18
  },
  {
    "name": "لا يحتاج الإنسان إلى صبر عند المخاوف والتهديدات",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 19
  },
  {
    "name": "جاء التحذير القرآني من الصبر في مواضع متعددة",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 20
  }
],[
  {
    "name": "من آثار الإيمان بعظمة الله تعالى",
    "select1": "تدبر القرآن",
    "select2": "الاعتبار بالأمم السابقة",
    "select3": "التسليم لله",
    "select4": "العدل في الجزء",
    "Answer": "التسليم لله",
    "unit": "1",
    "index": 1
  },
  {
    "name": "من آثار الإيمان بعظمة الله تعالى",
    "select1": "تعظيم خلقه",
    "select2": "التعالي على الغير",
    "select3": "استصغار الطغاة",
    "select4": "تأمل آيات القرآن",
    "Answer": "استصغار الطغاة",
    "unit": "1",
    "index": 2
  },
  {
    "name": "من آثار الإيمان بعظمة الله",
    "select1": "التضرع إلى الله",
    "select2": "التفكر في مخلوقاته",
    "select3": "الاعتبار بمن مضى",
    "select4": "هدايته وشرعه",
    "Answer": "التضرع إلى الله",
    "unit": "1",
    "index": 3
  },
  {
    "name": "يعد الخوف من الله والحياء منه أحد .......................",
    "select1": "مظاهر عظمة الله",
    "select2": "وسائل ترسيخ العظمة",
    "select3": "آثار الإيمان بعظمة الله",
    "select4": "مظاهر عدل الله",
    "Answer": "آثار الإيمان بعظمة الله",
    "unit": "1",
    "index": 4
  },
  {
    "name": "استصغار الطغاة وكل من سوى الله من .......................",
    "select1": "مظاهر عظمة الله",
    "select2": "وسائل ترسيخ الإيمان",
    "select3": "آثار الإيمان بعظمة الله",
    "select4": "الاعتبار بمن سبق",
    "Answer": "آثار الإيمان بعظمة الله",
    "unit": "1",
    "index": 5
  },
  {
    "name": "كلما ازداد قلب المؤمن تعظيماً لله تعالى فإنه .......................",
    "select1": "يسلم لأمره لله",
    "select2": "يحتار ويتردد",
    "select3": "يخاف غيره",
    "select4": "ينتابه القلق",
    "Answer": "يسلم لأمره لله",
    "unit": "1",
    "index": 6
  },
  {
    "name": "شجاعة النبي صلى الله عليه وآله وسلم عظيمة .......................",
    "select1": "يحيط بها لبس",
    "select2": "تختزل في موقف",
    "select3": "لا يحيط بها وصف",
    "select4": "تنحصر في موقفين",
    "Answer": "لا يحيط بها وصف",
    "unit": "1",
    "index": 7
  },
  {
    "name": "أعان النبي صلى الله عليه وسلم على الحكمة وحسن السياسة والتدبير .......................",
    "select1": "التسديد والتوفيق الإلهي",
    "select2": "الاعتماد الكلي على الذات",
    "select3": "الاستعانة بالخبراء والقادة",
    "select4": "النجاحات المستمرة",
    "Answer": "التسديد والتوفيق الإلهي",
    "unit": "1",
    "index": 8
  },
  {
    "name": "الإعداد المحكم والأداء الجيد في تنظيم الجيش وإدارة المعارك يحظى .......................",
    "select1": "رحمته بغيره",
    "select2": "كرمه وسخائه",
    "select3": "عبقريته النادرة",
    "select4": "مكانته الاجتماعية",
    "Answer": "عبقريته النادرة",
    "unit": "1",
    "index": 9
  },
  {
    "name": "تندرج الشدة فيما يقتضي الشدة، واللين فيما يقتضي اللين ضمن ....................... النبي صلى الله عليه وسلم",
    "select1": "توظيف قدرات",
    "select2": "حكمة وحسن سياسة",
    "select3": "رحمة وشفقة",
    "select4": "قوة ورحمة",
    "Answer": "حكمة وحسن سياسة",
    "unit": "1",
    "index": 10
  },
  {
    "name": "تعامل النبي صلى الله عليه وسلم مع القادة والزعماء ورفساء القبائل يندرج ضمن .......................",
    "select1": "الإحسان الواسع",
    "select2": "الحكمة وحسن السياسة",
    "select3": "الشجاعة والحزم",
    "select4": "الصدق والأمانة",
    "Answer": "الحكمة وحسن السياسة",
    "unit": "1",
    "index": 11
  },
  {
    "name": "الصبر شيء ....................... للاستقامة والالتزام",
    "select1": "عادي",
    "select2": "لحظي",
    "select3": "أساسي",
    "select4": "ثانوي",
    "Answer": "أساسي",
    "unit": "1",
    "index": 12
  },
  {
    "name": "يتجلى الصبر بـ .......................",
    "select1": "شهود يثبتونه",
    "select2": "صور متعددة",
    "select3": "منافع محدودة",
    "select4": "قوة تفرضه",
    "Answer": "صور متعددة",
    "unit": "1",
    "index": 13
  },
  {
    "name": "أساس للاستقامة والالتزام المستمر",
    "select1": "الصبر",
    "select2": "القوة",
    "select3": "المحاسبة",
    "select4": "العافية",
    "Answer": "الصبر",
    "unit": "1",
    "index": 14
  },
  {
    "name": "أمام الضغوط والمخاوف والأخطار يحتاج الإنسان إلى",
    "select1": "تراجع",
    "select2": "صبر",
    "select3": "مال",
    "select4": "سعي",
    "Answer": "صبر",
    "unit": "1",
    "index": 15
  },
  {
    "name": "تكرر ....................... الصبر في القرآن الكريم",
    "select1": "الحث على",
    "select2": "التحدير من",
    "select3": "العمل ب",
    "select4": "الفهم ل",
    "Answer": "الحث على",
    "unit": "1",
    "index": 16
  },
  {
    "name": "الشعور المستمر بالتقصير من ....................... للاستقامة.",
    "select1": "حديث",
    "select2": "تطوير مهني",
    "select3": "ارتقاء إيماني",
    "select4": "اعتناق",
    "Answer": "ارتقاء إيماني",
    "unit": "1",
    "index": 17
  },
  {
    "name": "من معاهدات الصلح التي أبرمها رسول الله صلى الله عليه وسلم مع بعض القبائل .......................",
    "select1": "دخول مكة",
    "select2": "مرور القوافل",
    "select3": "الاعتداء والخيانة",
    "select4": "حمل السلاح",
    "Answer": "دخول مكة",
    "unit": "1",
    "index": 18
  },
  {
    "name": "إرساء الأمن والاستقرار للدولة الإسلامية الناشئة وتوسيع نطاق الدعوة من نتائج .......................",
    "select1": "عقد التحالفات مع القبائل",
    "select2": "مراسلة ملوك العالم",
    "select3": "مواقف الملوك من الإسلام",
    "select4": "غزوة الأحزاب",
    "Answer": "مراسلة ملوك العالم",
    "unit": "1",
    "index": 19
  },
  {
    "name": "اتخذ رسول الله صلى الله عليه وآله وسلم خاتماً من ....................... وختم بها كتبه",
    "select1": "حديد",
    "select2": "ذهب",
    "select3": "فضة",
    "select4": "نحاس",
    "Answer": "فضة",
    "unit": "1",
    "index": 20
  },
  {
    "name": "نقش خاتم رسول الله صلى الله عليه وآله وسلم:",
    "select1": "لا إله إلا الله",
    "select2": "محمد رسول الله",
    "select3": "النبي محمد",
    "select4": "محمد نبي الله",
    "Answer": "محمد رسول الله",
    "unit": "1",
    "index": 21
  },
  {
    "name": "ظهر اليهود في مواجهتهم لرسول الله صلى الله عليه وسلم بـ .......................",
    "select1": "عجز كبير",
    "select2": "قوة عظيمة",
    "select3": "قوة متوسطة",
    "select4": "قوة مكافئة",
    "Answer": "عجز كبير",
    "unit": "1",
    "index": 22
  },
  {
    "name": "يثبت شرب الخمر بـ ....................... أو شاهدين عدلين",
    "select1": "بالإشاعة",
    "select2": "السماع",
    "select3": "الإقرار",
    "select4": "بالإكراه",
    "Answer": "الإقرار",
    "unit": "1",
    "index": 23
  },
  {
    "name": "إذا شرب رجل خمراً دون علمه بتحريمه",
    "select1": "يؤجل الحد عليه",
    "select2": "يعزر بالحبس",
    "select3": "يجلد دون الحد",
    "select4": "يسقط الحد عليه",
    "Answer": "يسقط الحد عليه",
    "unit": "1",
    "index": 24
  },
  {
    "name": "يعاقب ....................... تعزيراً من يتعاطى المخدرات أو يروج لها أو يسهل تهريبها.",
    "select1": "المتنصر",
    "select2": "القاضي",
    "select3": "المجتمع",
    "select4": "الشيخ",
    "Answer": "القاضي",
    "unit": "1",
    "index": 25
  },
  {
    "name": "العقوبة التعزيرية التي ينزلها القاضي على مهرب المخدرات ....................... وفق مقاصد الشرع",
    "select1": "رحمته بالمهرب",
    "select2": "تحقيق المصالح",
    "select3": "تستر للمهرب",
    "select4": "تشهير بالمهرب",
    "Answer": "تشهير بالمهرب",
    "unit": "1",
    "index": 26
  },
  {
    "name": "من العقوبات التعزيرية على تعاطي المخدرات وترويجها في قانون العقوبات اليمني .......................",
    "select1": "الإعدام",
    "select2": "التعهد",
    "select3": "المصادرة",
    "select4": "النفي",
    "Answer": "المصادرة",
    "unit": "1",
    "index": 27
  },
  {
    "name": "قد تصل الى خمس وعشرون عاماً في القانون اليمني .......................",
    "select1": "مروج المخدرات",
    "select2": "القاتل عمداً",
    "select3": "القاتل خطأ",
    "select4": "شارب الخمر",
    "Answer": "مروج المخدرات",
    "unit": "1",
    "index": 28
  },
  {
    "name": "يتجلى التزود بالوعي والبصيرة بـ .......................",
    "select1": "قوة الموقف والثبات",
    "select2": "تحقيق المصلحة الذاتية",
    "select3": "عمل المصالح المشتركة",
    "select4": "التنازل البسيط للطاعة",
    "Answer": "قوة الموقف والثبات",
    "unit": "1",
    "index": 29
  },
  {
    "name": "قوله تعالى: (وَالَّذِينَ اهْتَدَوْا زَادَهُمْ هُدًى وَآتَاهُمْ تَقْوَاهُمْ) يشير إلى الأخذ بأسباب .......................",
    "select1": "الهداية",
    "select2": "القوة",
    "select3": "العناية",
    "select4": "العلم",
    "Answer": "الهداية",
    "unit": "1",
    "index": 30
  }
]] 

//// #### arbi
let arabicA =[[
  {
    "name": "أنا مُحِبٌ المساكين طلباً للثواب ، العامل في المفعول لأجله هو اسم الفاعل (مُحِبٌ).",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 1
  },
  {
    "name": "بينما كنت أذاكر، نادتني أمي ، (بينما) ظرف زمان.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 2
  },
  {
    "name": "قد بَذَل الناسُ إلا المؤمنين ، حكم المستثنى واجب النصب.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 3
  },
  {
    "name": "يا ماسحاً رؤوس اليتامى ، لقد نلت الرضا ، نوع المنادى : نكرة مقصودة.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 4
  },
  {
    "name": "يَمُرُّ الطعام من الفم ، فالبُلعوم ، فقناة التَّرَاخِي.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 5
  },
  {
    "name": "المذاكرة لا تهملها ، جاء التوكيد اللفظي جملة.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 6
  },
  {
    "name": "كتاب (تاج العروس) للمرتضى الزبيدي.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 7
  },
  {
    "name": "رواية (زينب) للمنفلوطي.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 8
  },
  {
    "name": "أين الذين عهدتهم ولهزم ، الغرض من الاستفهام : التقرير.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 9
  },
  {
    "name": "رباه وا معتصماه انطلقت ملء أفواه الصبايا اليُتّم ، مفرد كلمة (أفواه) : فم.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 10
  },
  {
    "name": "عاطفة الشاعر في قصيدة (كن بلسماً) فردية ذاتية.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 11
  },
  {
    "name": "في نص (غربة الروح) ، الثلج رمز لبرودة الطقس في بغداد.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 12
  },
  {
    "name": "في الجملة: 'إنّما ينجح المخلصون'، كلمة 'إنّما' تجعل ما بعدها مرفوعاً بالابتداء.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 13
  },
  {
    "name": "كتاب (الأيام) للأديب عباس محمود العقاد.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 14
  },
  {
    "name": "يُعرب الاسم الواقع بعد 'لولا' غالباً مفعولاً به.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 15
  },
  {
    "name": "في النص الشعري (صخرة الملتقى) كان الغرض من النص هو الوصف.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 16
  },
  {
    "name": "في جملة: 'الحديقة تنسيقها جميل'، كلمة 'تنسيقها' تعرب خبراً مفرداً.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 17
  },
  {
    "name": "يُسمى الاستثناء بـ 'غير' و 'سوى' استثناءً متصلاً فقط.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 18
  },
  {
    "name": "'عسى' من أفعال الشروع التي ترفع المبتدأ وتنصب الخبر.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 19
  },
  {
    "name": "الشاعر إيليا أبو ماضي ينتمي إلى مدرسة الديوان الأدبية.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 20
  }
],[
  {
    "index": 1,
    "unit": "1",
    "name": "(قال الله تعالى: وَبِالْوَالِدَيْنِ إِحْسَانًا) ، (إِحْسَانًا) مفعول مطلق لفعل محذوف لوازمه مصدر دل على ...",
    "select1": "الأمر",
    "select2": "النهي",
    "select3": "الدعاء",
    "select4": "الاستفهام",
    "Answer": "الأمر"
  },
  {
    "index": 2,
    "unit": "1",
    "name": "عدد المفعولات في العبارة: (وقف الولد تحت المائدة ووقف المرتدين، انتظاراً لعطية تعطي له)...",
    "select1": "خمسة",
    "select2": "أربعة",
    "select3": "ثلاثة",
    "select4": "ستة",
    "Answer": "أربعة"
  },
  {
    "index": 3,
    "unit": "1",
    "name": "قال الله تعالى: (لَا تَقْرَبُوا الصَّلَاةَ وَأَنتُمْ سُكَارَىٰ) ، نوع الحال في الآية الكريمة ...",
    "select1": "مفرد",
    "select2": "جملة فعلية",
    "select3": "جملة اسمية",
    "select4": "شبه جملة",
    "Answer": "جملة اسمية"
  },
  {
    "index": 4,
    "unit": "1",
    "name": "(القصائد الشعرية أكثر من الموضوعات النثرية عدداً) ، التمييز (عدداً) محول عن ...",
    "select1": "فاعل",
    "select2": "مفعول به",
    "select3": "مبتدأ",
    "select4": "نعت",
    "Answer": "مبتدأ"
  },
  {
    "index": 5,
    "unit": "1",
    "name": "كان عدد المكفوفين (٣٢) طالباً ، يكتب العدد لفظاً على النحو الآتي ...",
    "select1": "اثنين وثلاثين",
    "select2": "ثلاث وثلاثين",
    "select3": "ثلاثين وثلاثون",
    "select4": "ثلاثة وثلاثون",
    "Answer": "اثنين وثلاثين"
  },
  {
    "index": 6,
    "unit": "1",
    "name": "يكتمل القمر في الليلة (١٤) ، يُصاغ العدد لفظاً على النحو الآتي ...",
    "select1": "الرابع عشر",
    "select2": "رابع عشر",
    "select3": "الرابعة عشرة",
    "select4": "رابعة عشر",
    "Answer": "الرابعة عشرة"
  },
  {
    "index": 7,
    "unit": "1",
    "name": "(هذه لوحة شكلها جميل) ، لتحويل النعت الحقيقي إلى نعت سببي نقول:",
    "select1": "جميلة شكل",
    "select2": "جميل شكلها",
    "select3": "جميلة شكلها",
    "select4": "جميلة أشكالاً",
    "Answer": "جميلة شكلها"
  },
  {
    "index": 8,
    "unit": "1",
    "name": "إحدى الجمل التالية تحتوي على بدل ...",
    "select1": "أعجبني إبداع الشاعر",
    "select2": "أعجبني الشاعر إبداعه",
    "select3": "أعجبني الشاعر إعجابي",
    "select4": "أعجبني الشاعر إبداعاً",
    "Answer": "أعجبني الشاعر إبداعه"
  },
  {
    "index": 9,
    "unit": "1",
    "name": "تكشف عن معنى كلمة (تزدهر) في مختار الصحاح في باب الشيء مع ...",
    "select1": "الياء والباء",
    "select2": "الزاي والراء",
    "select3": "الدال والراء",
    "select4": "الراء والزاي",
    "Answer": "الراء والزاي"
  },
  {
    "index": 10,
    "unit": "1",
    "name": "جميع ما يلي من فوائد اتصال الأدب العربي بحضارة العصر ما عدا ...",
    "select1": "إثراء اللغة بالمصطلحات",
    "select2": "ظهور الشعر القصصي",
    "select3": "ترسيخ اللهجة العامية",
    "select4": "ظهور الفن المسرحي",
    "Answer": "ترسيخ اللهجة العامية"
  },
  {
    "index": 11,
    "unit": "1",
    "name": "المرونة الفكرية بالتجديد من الخصائص والسمات، منها تقف ... (في سياق الخصائص الأدبية)",
    "select1": "الحال",
    "select2": "النعت",
    "select3": "العاطفة",
    "select4": "المفعول",
    "Answer": "العاطفة"
  },
  {
    "index": 12,
    "unit": "1",
    "name": "الاهتمام بالخيال والشعور العقلي والجزئي من الخصائص الفنية لمدرسة ...",
    "select1": "الكلاسيكية",
    "select2": "الرومانسية",
    "select3": "الواقعية",
    "select4": "الرمزية",
    "Answer": "الرومانسية"
  },
  {
    "index": 13,
    "unit": "1",
    "name": "تنتمي المدرسة الواقعية في ظروف ...",
    "select1": "مساوئ الألفاظ",
    "select2": "القوة على التجديد",
    "select3": "قوة الصياغة",
    "select4": "قوة عاطفية",
    "Answer": "القوة على التجديد"
  },
  {
    "index": 14,
    "unit": "1",
    "name": "(تلح) في الشطر: (وفي حركات الشوق سر لذيذ *** حتى متى يا قلب! تلح على) تعرب حالاً نوعها ...",
    "select1": "جملة فعلية",
    "select2": "جملة اسمية",
    "select3": "شبه جملة",
    "select4": "مفرد",
    "Answer": "جملة فعلية"
  },
  {
    "index": 15,
    "unit": "1",
    "name": "(دمع لا يكفكف) في الشطر: (سلام من صبا بردى أرق *** ودمع لا يكفكف يا دمشق) كناية عن ...",
    "select1": "الحسرة والندم",
    "select2": "غزارة الدمع المستمر",
    "select3": "قيمة الشفاه والوداع",
    "select4": "هرب ودمار يمشق",
    "Answer": "غزارة الدمع المستمر"
  },
  {
    "index": 16,
    "unit": "1",
    "name": "نوع القافية في البيت الشعري (مما هو من غير ... للمستفهم وشعور الشاعر) هي ...",
    "select1": "تتفرق",
    "select2": "الشروق",
    "select3": "الكُفّن",
    "select4": "القُروب",
    "Answer": "الكُفّن"
  },
  {
    "index": 17,
    "unit": "1",
    "name": "يُعرف فيها موضع السوابق واللحق ويفارق الطبع والتدوين ، التضمين الشعري في العبارة السابقة ...",
    "select1": "مقارنة",
    "select2": "فوزية",
    "select3": "مسوغ",
    "select4": "طباق",
    "Answer": "مقارنة"
  },
  {
    "index": 18,
    "unit": "1",
    "name": "(لست أهلاً له أو أصبر...) ، نوع الأسلوب في البيت ...",
    "select1": "أسلوب إنشائي",
    "select2": "غرض شعري",
    "select3": "غرض بلاغي",
    "select4": "بلاغة حديثات",
    "Answer": "أسلوب إنشائي"
  },
  {
    "index": 19,
    "unit": "1",
    "name": "تظهر ملامح الإفصاح لـ (إحياء التذكر) ، (التشجيع) (رؤيا) و(إحساني) ...",
    "select1": "الإهداء",
    "select2": "الإفصاح",
    "select3": "الوفاء",
    "select4": "الضّفاء",
    "Answer": "الإفصاح"
  },
  {
    "index": 20,
    "unit": "1",
    "name": "(يقفون عند الجمر ويوحدون) ، إعراب (عند) ...",
    "select1": "مفعول به",
    "select2": "ظرف مكان",
    "select3": "ظرف زمان",
    "select4": "اسم معطوف",
    "Answer": "ظرف مكان"
  },
  {
    "index": 21,
    "unit": "1",
    "name": "(مَنْ يعملْ خيراً يَلْقَ خيراً) ، إعراب الفعل (يَلْقَ) هو ...",
    "select1": "فعل مضارع مجزوم بالياء",
    "select2": "فعل مضارع مجزوم بحذف حرف العلة",
    "select3": "فعل ماضٍ مجزوم",
    "select4": "فعل مضارع مرفوع",
    "Answer": "فعل مضارع مجزوم بحذف حرف العلة"
  },
  {
    "index": 22,
    "unit": "1",
    "name": "تنتمي قصيدة (وطني) للشاعر أحمد شوقي إلى مدرسة ...",
    "select1": "الديوان",
    "select2": "الإحياء والبعث",
    "select3": "المهجر",
    "select4": "الرومانسية",
    "Answer": "الإحياء والبعث"
  },
  {
    "index": 23,
    "unit": "1",
    "name": "يُسمى الأسلوب في جملة (ما أجمل الصدق!) أسلوب ...",
    "select1": "تعجب",
    "select2": "نداء",
    "select3": "مدح",
    "select4": "ذم",
    "Answer": "تعجب"
  },
  {
    "index": 24,
    "unit": "1",
    "name": "(نعم ما تفعله الخير) ، إعراب كلمة (الخير) هو ...",
    "select1": "فاعل",
    "select2": "مفعول به",
    "select3": "مبتدأ مؤخر",
    "select4": "خبر",
    "Answer": "مبتدأ مؤخر"
  },
  {
    "index": 25,
    "unit": "1",
    "name": "في جملة (سلمت على تلميذ مجتهد)، (مجتهد) تعرب ...",
    "select1": "حال",
    "select2": "نعت مجرور",
    "select3": "مضاف إليه",
    "select4": "تمييز",
    "Answer": "نعت مجرور"
  },
  {
    "index": 26,
    "unit": "1",
    "name": "إحدى هذه الكلمات مصدر لفعل رباعي ...",
    "select1": "كتابة",
    "select2": "زراعة",
    "select3": "تعليم",
    "select4": "استغفار",
    "Answer": "تعليم"
  },
  {
    "index": 27,
    "unit": "1",
    "name": "(يا أيها الذين آمنوا) ، المنادى في الجملة هو ...",
    "select1": "أي",
    "select2": "أيها",
    "select3": "الذين",
    "select4": "آمنوا",
    "Answer": "أي"
  },
  {
    "index": 28,
    "unit": "1",
    "name": "تعني البلاغة في اللغة ...",
    "select1": "جمال اللفظ",
    "select2": "مطابقة الكلام لمقتضى الحال",
    "select3": "قوة المعاني",
    "select4": "الإيجاز",
    "Answer": "مطابقة الكلام لمقتضى الحال"
  },
  {
    "index": 29,
    "unit": "1",
    "name": "يُكشف عن كلمة (مُصْطَفَى) في المعجم في مادة ...",
    "select1": "ص-ف-ا",
    "select2": "ص-ف-ي",
    "select3": "ف-ص-ي",
    "select4": "ي-ص-ف",
    "Answer": "ص-ف-ي"
  },
  {
    "index": 30,
    "unit": "1",
    "name": "(ما حضر من الطلاب إلا طالب واحد) ، نوع الاستثناء هو ...",
    "select1": "تام مثبت",
    "select2": "تام منفي",
    "select3": "ناقص منفي",
    "select4": "منقطع",
    "Answer": "ناقص منفي"
  }
]]

///******##### english
let englishA =[[
  {
    "name": "Litmus paper is red in color.",
    "true": "T",
    "false": "F",
    "Answer": "F",
    "unit": "1",
    "index": 1
  },
  {
    "name": "A valley is found between two hills.",
    "true": "T",
    "false": "F",
    "Answer": "T",
    "unit": "1",
    "index": 2
  },
  {
    "name": "If the weather is misty, we can see clearly.",
    "true": "T",
    "false": "F",
    "Answer": "F",
    "unit": "1",
    "index": 3
  },
  {
    "name": "Banana has a curved shape.",
    "true": "T",
    "false": "F",
    "Answer": "T",
    "unit": "1",
    "index": 4
  },
  {
    "name": "A tractor is a machine used by a farmer.",
    "true": "T",
    "false": "F",
    "Answer": "T",
    "unit": "1",
    "index": 5
  },
  {
    "name": "\"Watch carefully\" means \"observe\".",
    "true": "T",
    "false": "F",
    "Answer": "T",
    "unit": "1",
    "index": 6
  },
  {
    "name": "Quantum theory states that light acts like waves.",
    "true": "T",
    "false": "F",
    "Answer": "T",
    "unit": "1",
    "index": 7
  },
  {
    "name": "People are able to hear ultrasonic sound.",
    "true": "T",
    "false": "F",
    "Answer": "F",
    "unit": "1",
    "index": 8
  },
  {
    "name": "During an earthquake the ground moves and shakes.",
    "true": "T",
    "false": "F",
    "Answer": "T",
    "unit": "1",
    "index": 9
  },
  {
    "name": "\"To watch carefully\" means \"to observe\".",
    "true": "T",
    "false": "F",
    "Answer": "T",
    "unit": "1",
    "index": 10
  },
  {
    "name": "Painkiller is used to get rid of headaches.",
    "true": "T",
    "false": "F",
    "Answer": "T",
    "unit": "1",
    "index": 11
  },
  {
    "name": "AIDS is a disease that was easily cured.",
    "true": "T",
    "false": "F",
    "Answer": "F",
    "unit": "1",
    "index": 12
  },
  {
    "name": "Smallpox is a disease that is only found in cattle.",
    "true": "T",
    "false": "F",
    "Answer": "F",
    "unit": "1",
    "index": 13
  },
  {
    "name": "\"Annum\" means \"yearly\".",
    "true": "T",
    "false": "F",
    "Answer": "T",
    "unit": "1",
    "index": 14
  },
  {
    "name": "The strength of the earthquake is measured on the microscope.",
    "true": "T",
    "false": "F",
    "Answer": "F",
    "unit": "1",
    "index": 15
  },
  {
    "name": "A prefix is a group of letters that added to the end of the stem.",
    "true": "T",
    "false": "F",
    "Answer": "F",
    "unit": "1",
    "index": 16
  },
  {
    "name": "Things you use in cooking are ingredients.",
    "true": "T",
    "false": "F",
    "Answer": "T",
    "unit": "1",
    "index": 17
  },
  {
    "name": "A flow chart is a simple way of showing information.",
    "true": "T",
    "false": "F",
    "Answer": "T",
    "unit": "1",
    "index": 18
  },
  {
    "name": "When the moon is close to the earth, it looks smaller.",
    "true": "T",
    "false": "F",
    "Answer": "F",
    "unit": "1",
    "index": 19
  },
  {
    "name": "The cabin is a small house in which you live.",
    "true": "T",
    "false": "F",
    "Answer": "T",
    "unit": "1",
    "index": 20
  }
],[
  {
    "name": "I will cook the dinner .......",
    "select1": "herself",
    "select2": "himself",
    "select3": "itself",
    "select4": "myself",
    "Answer": "myself",
    "unit": "1",
    "index": 1
  },
  {
    "name": "I **water** the flowers. The underlined word is a / an .......",
    "select1": "noun",
    "select2": "verb",
    "select3": "adjective",
    "select4": "adverb",
    "Answer": "verb",
    "unit": "1",
    "index": 2
  },
  {
    "name": "This little girl helped ....... old woman that lives nearby yesterday.",
    "select1": "a",
    "select2": "an",
    "select3": "(-)",
    "select4": "the",
    "Answer": "an",
    "unit": "1",
    "index": 3
  },
  {
    "name": "Nora speaks .......",
    "select1": "confidential",
    "select2": "confidently",
    "select3": "confidence",
    "select4": "confident",
    "Answer": "confidently",
    "unit": "1",
    "index": 4
  },
  {
    "name": "I saw Ann ....... a sandwich.",
    "select1": "eating",
    "select2": "is eating",
    "select3": "eats",
    "select4": "to eat",
    "Answer": "eating",
    "unit": "1",
    "index": 5
  },
  {
    "name": "Rami is as ....... as Sultn.",
    "select1": "smart",
    "select2": "smartest",
    "select3": "smartly",
    "select4": "smarter",
    "Answer": "smart",
    "unit": "1",
    "index": 6
  },
  {
    "name": "If I ....... you, I would buy a car .",
    "select1": "am",
    "select2": "were",
    "select3": "be",
    "select4": "are",
    "Answer": "were",
    "unit": "1",
    "index": 7
  },
  {
    "name": "An email ....... yesterday by Saeed.",
    "select1": "was sent",
    "select2": "is sent",
    "select3": "sends",
    "select4": "send",
    "Answer": "was sent",
    "unit": "1",
    "index": 8
  },
  {
    "name": "The new manager ....... tomorrow.",
    "select1": "arrive",
    "select2": "arriving",
    "select3": "is to arrive",
    "select4": "arrived",
    "Answer": "is to arrive",
    "unit": "1",
    "index": 9
  },
  {
    "name": "A cup of coffee costs 5 $, ....... a cup of tea costs 10 $.",
    "select1": "however",
    "select2": "whereas",
    "select3": "so",
    "select4": "therefore",
    "Answer": "whereas",
    "unit": "1",
    "index": 10
  },
  {
    "name": "If I ....... a scholarship, I would study medicine abroad.",
    "select1": "get",
    "select2": "am getting",
    "select3": "will got",
    "select4": "got",
    "Answer": "got",
    "unit": "1",
    "index": 11
  },
  {
    "name": "Of the following words, only ....... a compound.",
    "select1": "conscientiousness",
    "select2": "efficient",
    "select3": "lifeguard",
    "select4": "willingness",
    "Answer": "lifeguard",
    "unit": "1",
    "index": 12
  },
  {
    "name": "Electricity is used to lift the **lift**. The underlined word is a / an .......",
    "select1": "noun",
    "select2": "verb",
    "select3": "adjective",
    "select4": "adverb",
    "Answer": "noun",
    "unit": "1",
    "index": 13
  },
  {
    "name": "She drives .......",
    "select1": "faster",
    "select2": "fastly",
    "select3": "fast",
    "select4": "fastest",
    "Answer": "fast",
    "unit": "1",
    "index": 14
  },
  {
    "name": "She must be grateful ....... your help.",
    "select1": "to",
    "select2": "of",
    "select3": "about",
    "select4": "for",
    "Answer": "for",
    "unit": "1",
    "index": 15
  },
  {
    "name": "Ahmed broke the vase .......",
    "select1": "themselves",
    "select2": "itself",
    "select3": "herself",
    "select4": "himself",
    "Answer": "himself",
    "unit": "1",
    "index": 16
  },
  {
    "name": "Monica is as ....... as Lopez.",
    "select1": "clever",
    "select2": "most clever",
    "select3": "cleverer",
    "select4": "more clever",
    "Answer": "clever",
    "unit": "1",
    "index": 17
  },
  {
    "name": "How ....... milk do you want ?",
    "select1": "a lot of",
    "select2": "many",
    "select3": "any",
    "select4": "much",
    "Answer": "much",
    "unit": "1",
    "index": 18
  },
  {
    "name": "Yemen is a historical country. Not a lot of people visit it this days, .......",
    "select1": "however",
    "select2": "although",
    "select3": "whereas",
    "select4": "too",
    "Answer": "however",
    "unit": "1",
    "index": 19
  },
  {
    "name": "They ....... three new cars recently.",
    "select1": "produces",
    "select2": "producing",
    "select3": "have produced",
    "select4": "has produced",
    "Answer": "have produced",
    "unit": "1",
    "index": 20
  },
  {
    "name": "To change the word \"produce\" into a noun we add the suffix .......",
    "select1": "ed",
    "select2": "sion",
    "select3": "en",
    "select4": "tion",
    "Answer": "tion",
    "unit": "1",
    "index": 21
  },
  {
    "name": "The children ....... now.",
    "select1": "sleeps",
    "select2": "sleeping",
    "select3": "slept",
    "select4": "are sleeping",
    "Answer": "are sleeping",
    "unit": "1",
    "index": 22
  },
  {
    "name": "Khalid speaks English **well**. The underlined word is a / an .......",
    "select1": "adjective",
    "select2": "adverb",
    "select3": "noun",
    "select4": "verb",
    "Answer": "adverb",
    "unit": "1",
    "index": 23
  },
  {
    "name": "Get Sally ....... the room.",
    "select1": "cleans",
    "select2": "clean",
    "select3": "to clean",
    "select4": "cleaned",
    "Answer": "to clean",
    "unit": "1",
    "index": 24
  },
  {
    "name": "He ....... be Zaid Ali. Zaid Ali is dead.",
    "select1": "can't",
    "select2": "will",
    "select3": "must",
    "select4": "could",
    "Answer": "can't",
    "unit": "1",
    "index": 25
  },
  {
    "name": "He liked the books ....... he has read recently.",
    "select1": "which",
    "select2": "why",
    "select3": "who",
    "select4": "when",
    "Answer": "which",
    "unit": "1",
    "index": 26
  },
  {
    "name": "....... is a compound word.",
    "select1": "headlines",
    "select2": "hardest",
    "select3": "heading",
    "select4": "header",
    "Answer": "headlines",
    "unit": "1",
    "index": 27
  },
  {
    "name": "I'm interested ....... writing stories .",
    "select1": "for",
    "select2": "on",
    "select3": "off",
    "select4": "in",
    "Answer": "in",
    "unit": "1",
    "index": 28
  },
  {
    "name": "She ....... to study English yesterday.",
    "select1": "start",
    "select2": "starts",
    "select3": "starting",
    "select4": "started",
    "Answer": "started",
    "unit": "1",
    "index": 29
  },
  {
    "name": "Of the following words, only ....... a compound.",
    "select1": "conscientiousness",
    "select2": "efficient",
    "select3": "lifeguard",
    "select4": "willingness",
    "Answer": "lifeguard",
    "unit": "1",
    "index": 30
  }
]] 

/// physics
let physicsA =[[
    {
        "name" : "الدفع الذي يتلقاه الصاروخ يساوي مقدار التغير في طاقة حركته",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "خ",
        "unit" : "1",
        "diffLevel" : "Normal",
        "un_num" : 1,
        "index" : 1
    },{
        "name" : "تعد حركة الأقمار الصناعية من الحركات الدائرية المنتظمة",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "ص",
        "unit" : "1",
        "diffLevel" : "Normal",
        "un_num" : 2,
        "index" : 2
    },{
        "name" : "تعمل الصواريخ بطريقة أفضل في الفضاء الخارجي بسبب انعدام الجاذبية",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "خ",
        "unit" : "1",
        "diffLevel" : "Normal",
        "un_num" : 3,
        "index" : 3
    },{
        "name" : "جسم ساكن كتلته (۲) كجم ، تلقى دفعا مقداره (۲۰) نيوتن . ث ، فإن سرعته بعد الدفع مباشرة تساوي (۱۰) م / ث.",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "ص",
        "unit" : "1",
        "diffLevel" : "Normal",
        "un_num" : 4,
        "index" : 4
    },{
        "name" : "القمر الصناعي الذي يدور حول الأرض في مسار دائري نصف قطر مداره (۸۰۰۰) كم يتحرك بسرعة مدارية وتساوي (۸) كم / ث",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "خ",
        "unit" : "1",
        "diffLevel" : "Normal",
        "un_num" : 5,
        "index" : 5
    },{
        "name" : "اتجاه كمية التحرك الخطى تكون في اتجاه سرعة الجسم المتحرك",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "ص",
        "unit" : "1",
        "diffLevel" : "Normal",
        "un_num" : 6,
        "index" : 6
    },{
        "name" : "توضع الأقمار الصناعية على ارتفاعات لا تقل عن ( ١٥٠) كم فوق سطح الأرض لتجنب مقاومة الهواء الجوي",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "ص",
        "unit" : "1",
        "diffLevel" : "Normal",
        "un_num" : 7,
        "index" : 7
    },{
        "name" : " تعمل الصواريخ بطريقة أفضل في الفضاء الخارجي بسبب انعدام مقاومة الهواء",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "ص",
        "unit" : "1",
        "diffLevel" : "Normal",
        "un_num" : 8,
        "index" : 8
    },{
        "name" : "الجسم الذي كتلته (۱) كجم ، وكمية تحركه الخطي (۱۱) كجم . م / ث يقطع خلال ثانية واحدة مسافة (۱۱) م",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "ص",
        "unit" : "1",
        "diffLevel" : "Normal",
        "un_num" : 9,
        "index" : 9
    },{
        "name" : "قمر صناعي يدور حول الأرض على ارتفاع (٩٤٠) كم من سطح الأرض ، فإن سرعته المدارية (٧٣٨٤) م / ث تقريبا",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "ص",
        "unit" : "1",
        "diffLevel" : "Normal",
        "un_num" : 10,
        "index" : 10
    },{
        "name" : "كمية التحرك الخطى تساوي حاصل ضرب الكتلة في مربع السرعة الخطية",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "خ",
        "unit" : "1",
        "diffLevel" : "Easy",
        "un_num" : 11,
        "index" : 11
    },{
        "name" : "في التصادم ذي بعدين يكون مجموع كميتي التحرك للجسمين المتصادمين قبل وبعد التصادم متساوية",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "ص",
        "unit" : "1",
        "diffLevel" : "Normal",
        "un_num" : 12,
        "index" : 12
    },{
        "name" : "جسم ساكن كتلته (٤) كجم اكتسب دفعا مقداره (٦٠) نيوتن . ث ، فإن سرعته ستصبح (١٥) م / ث",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "ص",
        "unit" : "1",
        "diffLevel" : "Difficult",
        "un_num" : 13,
        "index" : 13
    },{
        "name" : "قمر صناعي يدور حول الأرض على ارتفاع ( ٢٥٠) كم ، فإن سرعته المدارية (٧٧٥٧,٦) م / ثم",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "ص",
        "unit" : "1",
        "diffLevel" : "Difficult",
        "un_num" : 14,
        "index" : 14
    },{
        "name" : "تعمل الصواريخ بطريقة أفضل في الفضاء الخارجي بسبب انعدام الجاذبية",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "خ",
        "unit" : "1",
        "diffLevel" : "Easy",
        "un_num" : 15,
        "index" : 15
    },{
        "name" : "يفلت أي جسم من مجال الجاذبية الأرضية إذا كانت سرعته عند الانطلاق (۱۱,۲) م / ث",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "خ",
        "unit" : "1",
        "diffLevel" : "Normal",
        "un_num" : 16,
        "index" : 16
    },{
        "name" : "التصائم غير المرن هو التصادم الذي يكون فيه مجموع طاقة حركة الأجسام قبل التصادم أكبر من مجموع طاقة و حركتها بعد التصادم",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "ص",
        "unit" : "1",
        "diffLevel" : "Difficult",
        "un_num" : 17,
        "index" : 17
    },{
        "name" : "دفع محرك الصاروخ يساوي دفع الغازات ويُعاكسة في الاتجاه",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "ص",
        "unit" : "1",
        "diffLevel" : "Normal",
        "un_num" : 18,
        "index" : 18
    },{
        "name" : "جسم كتلته (۲۰۰۰) جرام يتحرك بسرعة (۳) م / ث ، فإن كمية تحركه (٦) كجم . م/ ثم",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "ص",
        "unit" : "1",
        "diffLevel" : "Easy",
        "un_num" : 19,
        "index" : 19
    },{
        "name" : "القمر الصناعي الذي نصف قطر مداره (٦٨٠٠) كم ، تكون سرعته المدارية (۷,٦٧) كم / ث",
        "true" : "ص",
        "false" : "خ",
        "Answer" : "ص",
        "unit" : "1",
        "diffLevel" : "Difficulty",
        "un_num" : 20,
        "index" : 20
    },
]
,[
  {
    "name": "من تطبيقات مبدأ حفظ كمية التحرك الخطى",
    "select1": "حركة الأقمار الصناعية",
    "select2": "الصواريخ ذاتية الدفع",
    "select3": "التنبؤ بالكسوف",
    "select4": "المولدات الكهربائية",
    "Answer": "الصواريخ ذاتية الدفع",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 1,
    "index": 1
  },
  {
    "name": "السرعة التي يدور بها القمر الصناعي حول الأرض تسمى السرعة",
    "select1": "المدارية",
    "select2": "الإفلات",
    "select3": "الابتدائية",
    "select4": "الزاوية",
    "Answer": "المدارية",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 2,
    "index": 2
  },
  {
    "name": "الشرط اللازم لدوران القمر الصناعي حول الأرض في مدار دائري ثابت أن تكون",
    "select1": "قوة الجذب = قوة الدفع",
    "select2": "قوة الجذب = قوة الطرد",
    "select3": "الطاقة الحركية = الطاقة الكامنة",
    "select4": "الطاقة الحركية = شغل الجاذبية",
    "Answer": "قوة الجذب = قوة الدفع",
    "unit": "1",
    "diffLevel": "Normal",
    "un_num": 3,
    "index": 3
  },
  {
    "name": "عجلة المقذوف في الاتجاه الأفقي",
    "select1": "تساوى صفر",
    "select2": "مقدار ثابت",
    "select3": "قيمة عظمى",
    "select4": "قيشمة متغيرة",
    "Answer": "تساوى صفر",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 4,
    "index": 4
  },
  {
    "name": "السرعة التي يدور بها القمر الصناعي حول الأرض تسمى السرعة",
    "select1": "المدارية",
    "select2": "الإفلات",
    "select3": "الابتدائية",
    "select4": "الزاوية",
    "Answer": "المدارية",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 5,
    "index": 5
  },
  {
    "name": "من التطبيقات العملية على مبدأ حفظ كمية التحرك الزاوي",
    "select1": "التنبؤ بالخسوف",
    "select2": "المقذوفات",
    "select3": "التصادمات",
    "select4": "السقوط الحري",
    "Answer": "التنبؤ بالخسوف",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 6,
    "index": 6
  },
  {
    "name": "عند إطلاق الصواريخ ذاتية الدفع يجب أن نضع شيئين في الاعتبار هما اتجاه الصاروخ و",
    "select1": "عجلته",
    "select2": "سرعته",
    "select3": "وزنه",
    "select4": "كتلته",
    "Answer": "عجلته",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 7,
    "index": 7
  },
  {
    "name": "وحدة قياس الكمية ) طاح / ع ) حيث : ( طاح ) طاقة الحركة ، ( ع ) السرعة ، هي نفس وحدة قياس",
    "select1": "الكتلة",
    "select2": "كمية التحرك",
    "select3": "العجلة",
    "select4": "عزم القصور الذاتين",
    "Answer": "كمية التحرك",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 8,
    "index": 8
  },
  {
    "name": "أحد التطبيقات العملية لقانون حفظ كمية التحرك الزاوي هو التنبؤ بحدوث",
    "select1": "الزلازل",
    "select2": "الأعاصير",
    "select3": "الكسوف والخسوف",
    "select4": "الفيضانات",
    "Answer": "الكسوف والخسوف",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 9,
    "index": 9
  },
  {
    "name": "وحدة قياس كمية التحرك الخطي تكافئ وحدة قياس",
    "select1": "الدفع",
    "select2": "طاقة الحركة",
    "select3": "الشغل",
    "select4": "القوة",
    "Answer": "الدفع",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 10,
    "index": 10
  },
  {
    "name": "كمية التحرك الزاوي لجسم تتناسب تناسبا عكسيا مع",
    "select1": "السرعة الزاوية",
    "select2": "عزم القصور الدوراني",
    "select3": "الزمن الدوري",
    "select4": "كتلة الجسم",
    "Answer": "الزمن الدوري",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 11,
    "index": 11
  },
  {
    "name": "عجلة المقذوف الأفقية (جـــ س)",
    "select1": "تزايدية",
    "select2": "تناقصية",
    "select3": "منتظمة",
    "select4": "صفر",
    "Answer": "صفر",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 12,
    "index": 12
  },
  {
    "name": "الكمية الناتجة من حاصل ضرب الكتلة في السرعة هي .....",
    "select1": "العجلة",
    "select2": "القوة",
    "select3": "الطاقة الحركية",
    "select4": "كمية التحرك الخطي",
    "Answer": "كمية التحرك الخطي",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 13,
    "index": 13
  },
  {
    "name": "إذا كانت الطاقة الحركية لجسم عند لحظة إطلاقه مساوية لطاقة وضعه بالنسبة لمركز الأرض فسوف.......",
    "select1": "يدور حول الأرض",
    "select2": "يعود للأرض",
    "select3": "يفلت من الجاذبية",
    "select4": "يسكن في المدار",
    "Answer": "يفلت من الجاذبية",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 14,
    "index": 14
  },
  {
    "name": "استخدم.... في إرسال معلومات عن الطقس والتوقعات الجوية",
    "select1": "الصاروخ الفضائي",
    "select2": "القمر الصناعي",
    "select3": "المكوك الفضائي",
    "select4": "المختبر الفضائي",
    "Answer": "القمر الصناعي",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 15,
    "index": 15
  },
  {
    "name": "تدور الأرض حول الشمس وفق مبدأ",
    "select1": "الفعل ورد الفعل",
    "select2": "حفظ كمية التحرك الخطي",
    "select3": "الدفع",
    "select4": "حفظ كمية التحرك الزاوي",
    "Answer": "حفظ كمية التحرك الزاوي",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 16,
    "index": 16
  },
  {
    "name": "إذا قذف جسم بسرعة رأسية أكبر من (۱۱,۲) كم / ث ، فإنه",
    "select1": "يسكن في المدار",
    "select2": "يتحرك في المدار",
    "select3": "يفلت من الجاذبية",
    "select4": "يعود للأرض",
    "Answer": "يفلت من الجاذبية",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 17,
    "index": 17
  },
  {
    "name": "وحدة القياس نيوتن . ث) هي نفس وحدة قياس .",
    "select1": "كمية التحرك الخطى",
    "select2": "كمية التحرك الزاوي",
    "select3": "الطاقة",
    "select4": "القدرة",
    "Answer": "كمية التحرك الخطى",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 18,
    "index": 18
  },
  {
    "name": "وحدة قياس كمية التحرك الخطي تكافئ وحدة قياس",
    "select1": "الدفع",
    "select2": "طاقة الحركة",
    "select3": "الشغل",
    "select4": "القوة",
    "Answer": "القوة",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 19,
    "index": 19
  },
  {
    "name": "لكي يدور القمر الصناعي في مدار حول الأرض يجب أن تكون قوة الطرد المركزي تساوي",
    "select1": "قوة الصعود",
    "select2": "قوة الدفع",
    "select3": "قوة الاحتكاك",
    "select4": "قوة الجاذبية",
    "Answer": "قوة الجاذبية",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 20,
    "index": 20
  },
  {
    "name": "يتناسب عزم القصور الذاتي الدوراني تناسباً طردياً مع مربع ......",
    "select1": "الكتلة",
    "select2": "نصف القطر",
    "select3": "لسرعة الزاوية",
    "select4": "السرعة",
    "Answer": "نصف القطر",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 21,
    "index": 21
  },
  {
    "name": "عجلة المقذوف في الاتجاه الأفقي",
    "select1": "تساوى صفر",
    "select2": "مقدار ثابت",
    "select3": "قيمة عظمى",
    "select4": "قيشمة متغيرة",
    "Answer": "تساوى صفر",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 22,
    "index": 22
  },
  {
    "name": "السرعة التي يدور بها القمر الصناعي حول الأرض تسمى السرعة",
    "select1": "المدارية",
    "select2": "الإفلات",
    "select3": "الابتدائية",
    "select4": "الزاوية",
    "Answer": "المدارية",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 23,
    "index": 23
  },
  {
    "name": "من التطبيقات العملية على مبدأ حفظ كمية التحرك الزاوي",
    "select1": "التنبؤ بالخسوف",
    "select2": "المقذوفات",
    "select3": "التصادمات",
    "select4": "السقوط الحري",
    "Answer": "التنبؤ بالخسوف",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 24,
    "index": 24
  },
  {
    "name": "عند إطلاق الصواريخ ذاتية الدفع يجب أن نضع شيئين في الاعتبار هما اتجاه الصاروخ و",
    "select1": "عجلته",
    "select2": "سرعته",
    "select3": "وزنه",
    "select4": "كتلته",
    "Answer": "عجلته",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 25,
    "index": 25
  },
  {
    "name": "وحدة قياس الكمية ) طاح / ع ) حيث : ( طاح ) طاقة الحركة ، ( ع ) السرعة ، هي نفس وحدة قياس",
    "select1": "الكتلة",
    "select2": "كمية التحرك",
    "select3": "العجلة",
    "select4": "عزم القصور الذاتين",
    "Answer": "كمية التحرك",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 26,
    "index": 26
  },
  {
    "name": "أحد التطبيقات العملية لقانون حفظ كمية التحرك الزاوي هو التنبؤ بحدوث",
    "select1": "الزلازل",
    "select2": "الأعاصير",
    "select3": "الكسوف والخسوف",
    "select4": "الفيضانات",
    "Answer": "الكسوف والخسوف",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 27,
    "index": 27
  },
  {
    "name": "وحدة قياس كمية التحرك الخطي تكافئ وحدة قياس",
    "select1": "الدفع",
    "select2": "طاقة الحركة",
    "select3": "الشغل",
    "select4": "القوة",
    "Answer": "الدفع",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 28,
    "index": 28
  },
  {
    "name": "أحد التطبيقات العملية لقانون حفظ كمية التحرك الزاوي هو التنبؤ بحدوث",
    "select1": "الزلازل",
    "select2": "الأعاصير",
    "select3": "الكسوف والخسوف",
    "select4": "الفيضانات",
    "Answer": "الكسوف والخسوف",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 29,
    "index": 29
  },
  {
    "name": "وحدة قياس كمية التحرك الخطي تكافئ وحدة قياس",
    "select1": "الدفع",
    "select2": "طاقة الحركة",
    "select3": "الشغل",
    "select4": "القوة",
    "Answer": "الدفع",
    "unit": "1",
    "diffLevel": "Easy",
    "un_num": 30,
    "index": 30
  }
]]

/// ###### Chm  
let chamA=[
    [
  {
    "name": "الخبث يحمي الحديد المذاب في الفرن اللافح من التأكسد.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 1
  },
  {
    "name": "يتفاعل الحديد مع حمض الهيدروكلوريك المخفف مكوناً كلوريد الحديد (III).",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 2
  },
  {
    "name": "تختلف خامات الحديد في تركيبها الكيميائي والمعدني.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 3
  },
  {
    "name": "يعتبر (Fe) من العناصر المختزلة الجيدة.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 4
  },
  {
    "name": "الطاقة الحرارية لمواد التفاعلات أكبر من المواد الناتجة في التفاعلات الماصة.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 5
  },
  {
    "name": "يتفاعل الحديد مع حمض الهيدروكلوريك مكوناً كلوريد الحديد (II).",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 6
  },
  {
    "name": "\"الماجنيتيت\" خام يسمى أكسيد الحديد اللامائي.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 7
  },
  {
    "name": "المحتوى الحراري لنواتج التفاعلات الماصة للحرارة أكبر من نواتج التفاعلات الطاردة للحرارة.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 8
  },
  {
    "name": "يمكن استخدام الخبث الناتج من تعدين الحديد في صناعة الأسمنت.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 9
  },
  {
    "name": "الصيغة الكيميائية لأكسيد الحديد المغناطيسي هي (Fe₂O₃H₂O).",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 10
  },
  {
    "name": "الحديد في حالته النقية قاسيًا جدًا.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 11
  },
  {
    "name": "المحتوى الحراري للمتفاعلات في التفاعلات الماصة للحرارة أكبر من النواتج.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 12
  },
  {
    "name": "يتفاعل الحديد مع حمض الهيدروكلوريك المخفف مكوناً كلوريد الحديد (III).",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 13
  },
  {
    "name": "الصيغة الكيميائية لأكسيد الحديد المغناطيسي هي (Fe₂O₃nH₂O).",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 14
  },
  {
    "name": "الحديد في حالته النقية قاسيًا جدًا.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 15
  },
  {
    "name": "المحتوى الحراري للمتفاعلات في التفاعلات الماصة للحرارة أكبر من النواتج.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 16
  },
  {
    "name": "نسبة الكربون في الحديد الفولاذي (12) %.",
    "true": "ص",
    "false": "خ",
    "Answer": "خ",
    "unit": "1",
    "index": 17
  },
  {
    "name": "يتفاعل الحديد مع حمض الهيدروكلوريك مكوناً كلوريد الحديد (II).",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 18
  },
  {
    "name": "تختلف خامات الحديد في تركيبها الكيميائي والمعدني.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 19
  },
  {
    "name": "المحتوى الحراري لنواتج التفاعلات الماصة للحرارة أكبر من نواتج التفاعلات الطاردة.",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 20
  }
],[
  {
    "name": "أعلى نسبة حديد توجد في خام ...",
    "select1": "الهيماتيت",
    "select2": "الماجنيتيت",
    "select3": "الليمنيت",
    "select4": "كبريتيد الحديد",
    "Answer": "الهيماتيت",
    "unit": "1",
    "index": 1
  },
  {
    "name": "يتم اختزال الماجنيتيت في ... الفرن اللافح.",
    "select1": "قاع",
    "select2": "وسط",
    "select3": "أسفل",
    "select4": "قمة",
    "Answer": "وسط",
    "unit": "1",
    "index": 2
  },
  {
    "name": "العناصر الانتقالية المقاومة للتآكل عناصر المجموعة ...",
    "select1": "VB",
    "select2": "IVB",
    "select3": "VIIB",
    "select4": "VIII",
    "Answer": "VB",
    "unit": "1",
    "index": 3
  },
  {
    "name": "السلسلة الانتقالية الرئيسية الأولى يتم فيها ملء المستوى الفرعي ...",
    "select1": "3d",
    "select2": "4d",
    "select3": "4f",
    "select4": "5f",
    "Answer": "3d",
    "unit": "1",
    "index": 4
  },
  {
    "name": "عند إضافة (NaOH) إلى محلول كلوريد الحديدوز يتكون لون ...",
    "select1": "أخضر",
    "select2": "أزرق",
    "select3": "أحمر",
    "select4": "بني",
    "Answer": "أخضر",
    "unit": "1",
    "index": 5
  },
  {
    "name": "يتواجد الحديد بنسبة تصل إلى (70%) في خام ...",
    "select1": "الماجنيتيت",
    "select2": "الهيماتيت",
    "select3": "الليمنيت",
    "select4": "السيدريت",
    "Answer": "الماجنيتيت",
    "unit": "1",
    "index": 6
  },
  {
    "name": "عند تفاعل (Fe₃O₄) مع (CO) ينتج (CO₂) و ...",
    "select1": "Fe",
    "select2": "FeO",
    "select3": "Fe₂O₃",
    "select4": "FeCO₃",
    "Answer": "FeO",
    "unit": "1",
    "index": 7
  },
  {
    "name": "من عناصر المجموعة الفرعية (IIB) ...",
    "select1": "الزنك",
    "select2": "النحاس",
    "select3": "الحديد",
    "select4": "المنجنيز",
    "Answer": "الزنك",
    "unit": "1",
    "index": 8
  },
  {
    "name": "يتابع فيها امتلاء المستوى الفرعي (4d) عناصر السلسلة الانتقالية ...",
    "select1": "الأولى",
    "select2": "الثانية",
    "select3": "الثالثة",
    "select4": "الرابعة",
    "Answer": "الثانية",
    "unit": "1",
    "index": 9
  },
  {
    "name": "عند إضافة محلول ثيوسيانات البوتاسيوم إلى محلول حديد (III) يتكون محلول لونه ...",
    "select1": "أزرق",
    "select2": "بني",
    "select3": "أحمر دموي",
    "select4": "أخضر",
    "Answer": "أحمر دموي",
    "unit": "1",
    "index": 10
  },
  {
    "name": "عملية اختزال (Fe₂O₃) إلى (Fe) في الفرن اللافح تتم في ... الفرن.",
    "select1": "وسط",
    "select2": "أسفل",
    "select3": "قمة",
    "select4": "خارج",
    "Answer": "وسط",
    "unit": "1",
    "index": 11
  },
  {
    "name": "أي من التالي يميز المجموعة (VIIB) ...",
    "select1": "المنجنيزات",
    "select2": "مقاومة فائقة للتآكل",
    "select3": "غالية الثمن",
    "select4": "كيمياء بسيطة",
    "Answer": "المنجنيزات",
    "unit": "1",
    "index": 12
  },
  {
    "name": "أعلى نسبة حديد توجد في خام ...",
    "select1": "الهيماتيت",
    "select2": "الماجنيتيت",
    "select3": "الليمنيت",
    "select4": "كبريتيد الحديد",
    "Answer": "الماجنيتيت",
    "unit": "1",
    "index": 13
  },
  {
    "name": "يتم اختزال الماجنيتيت في ... الفرن اللافح.",
    "select1": "قاع",
    "select2": "وسط",
    "select3": "أسفل",
    "select4": "قمة",
    "Answer": "وسط",
    "unit": "1",
    "index": 14
  },
  {
    "name": "العناصر الانتقالية المقاومة للتآكل عناصر المجموعة ...",
    "select1": "VB",
    "select2": "IVB",
    "select3": "VIIB",
    "select4": "VIII",
    "Answer": "VIII",
    "unit": "1",
    "index": 15
  },
  {
    "name": "السلسلة الانتقالية الرئيسية الأولى يتم فيها ملء المستوى الفرعي ...",
    "select1": "3d",
    "select2": "4d",
    "select3": "4f",
    "select4": "5f",
    "Answer": "3d",
    "unit": "1",
    "index": 16
  },
  {
    "name": "عند إضافة (NaOH) إلى محلول كلوريد الحديدوز يتكون لون ...",
    "select1": "أخضر",
    "select2": "أزرق",
    "select3": "أحمر",
    "select4": "بني",
    "Answer": "أخضر",
    "unit": "1",
    "index": 17
  },
  {
    "name": "يتواجد الحديد بنسبة تصل إلى (70%) في خام ...",
    "select1": "الماجنيتيت",
    "select2": "الهيماتيت",
    "select3": "الليمنيت",
    "select4": "السيدريت",
    "Answer": "الماجنيتيت",
    "unit": "1",
    "index": 18
  },
  {
    "name": "عند تفاعل (Fe₃O₄) مع (CO) ينتج (CO₂) و ...",
    "select1": "Fe",
    "select2": "FeO",
    "select3": "Fe₂O₃",
    "select4": "FeCO₃",
    "Answer": "Fe",
    "unit": "1",
    "index": 19
  },
  {
    "name": "من عناصر المجموعة الفرعية (IIB) ...",
    "select1": "الزنك",
    "select2": "النحاس",
    "select3": "الحديد",
    "select4": "المنجنيز",
    "Answer": "الزنك",
    "unit": "1",
    "index": 20
  },
  {
    "name": "يتابع فيها امتلاء المستوى الفرعي (4d) عناصر السلسلة الانتقالية ...",
    "select1": "الأولى",
    "select2": "الثانية",
    "select3": "الثالثة",
    "select4": "الرابعة",
    "Answer": "الثانية",
    "unit": "1",
    "index": 21
  },
  {
    "name": "عند إضافة محلول ثيوسيانات البوتاسيوم إلى محلول حديد (III) يتكون محلول لونه ...",
    "select1": "أزرق",
    "select2": "بني",
    "select3": "أحمر دموي",
    "select4": "أخضر",
    "Answer": "أحمر دموي",
    "unit": "1",
    "index": 22
  },
  {
    "name": "عملية اختزال (Fe₂O₃) إلى (Fe) في الفرن اللافح تتم في ... الفرن.",
    "select1": "وسط",
    "select2": "أسفل",
    "select3": "قمة",
    "select4": "خارج",
    "Answer": "أسفل",
    "unit": "1",
    "index": 23
  },
  {
    "name": "أي من التالي يميز المجموعة (VIIB) ...",
    "select1": "المنجنيزات",
    "select2": "مقاومة فائقة للتآكل",
    "select3": "غالية الثمن",
    "select4": "كيمياء بسيطة",
    "Answer": "المنجنيزات",
    "unit": "1",
    "index": 24
  },
  {
    "name": "يتكون راسب أزرق داكن عند تفاعل محلول ملح الحديدوز مع ...",
    "select1": "هيدروكسيد الصوديوم",
    "select2": "هيدروكسيد الأمونيوم",
    "select3": "حديدو سيانيد البوتاسيوم",
    "select4": "حديدي سيانيد البوتاسيوم",
    "Answer": "حديدي سيانيد البوتاسيوم",
    "unit": "1",
    "index": 25
  },
  {
    "name": "نسبة الحديد كبيرة في خام ...",
    "select1": "الماجنيتيت",
    "select2": "الهيماتيت",
    "select3": "الليمنيت",
    "select4": "السيدريت",
    "Answer": "الماجنيتيت",
    "unit": "1",
    "index": 26
  },
  {
    "name": "عملية اختزال (FeO) إلى (Fe) في الفرن اللافح تتم في ... الفرن.",
    "select1": "وسط",
    "select2": "قمة",
    "select3": "أسفل",
    "select4": "خارج",
    "Answer": "أسفل",
    "unit": "1",
    "index": 27
  },
  {
    "name": "أحد هذه العناصر لا يتأثر بالعوامل المؤكسدة أو الأحماض المعدنية القوية هو ...",
    "select1": "Sc",
    "select2": "V",
    "select3": "Cd",
    "select4": "Hf",
    "Answer": "Hf",
    "unit": "1",
    "index": 28
  },
  {
    "name": "السلسلة الانتقالية الثانية يتم فيها ملء المستوى الفرعي ...",
    "select1": "3d",
    "select2": "4d",
    "select3": "5d",
    "select4": "6d",
    "Answer": "4d",
    "unit": "1",
    "index": 29
  },
  {
    "name": "العنصر الانتقالي ذو الترتيب 13 في القشرة الأرضية هو ...",
    "select1": "Fe",
    "select2": "Cu",
    "select3": "Mn",
    "select4": "Zn",
    "Answer": "Fe",
    "unit": "1",
    "index": 30
  }
]]

let mathA =[]
// ####### Biology 
let biologyA=[
    [
  {
    "name": "الصمامات تمنع ارتجاع الدم في القلب",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 1
  },
  {
    "name": "المواد الكربوهيدراتية تتحلل لتكوين مادة السكري",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 2
  },
  {
    "name": "التراكيب الحسية المكارية مسؤولة عن الإحساس بلمس الجلد",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 3
  },
  {
    "name": "عصر البرمائيات هو العصر الكربوني",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 4
  },
  {
    "name": "التبرعم من طرق التكاثر اللاجنسي عند الحيوانات",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 5
  },
  {
    "name": "الفراخ في الأيام الأولى بعد التفقيس تتغذى بالزلال",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 6
  },
  {
    "name": "عدد كروموسومات الفراولة الأحادية هو 2n",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 7
  },
  {
    "name": "بعض الاندوسبيرم يبقى محاطًا بالجنين في القمح",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 8
  },
  {
    "name": "التخصيب ليس من مراحل دورة المبيض",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 9
  },
  {
    "name": "الهيدرا تتحرك في الماء بواسطة البراعم",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 10
  },
  {
    "name": "تطبيق البوصة عند سماعه في التلفون يتم في الطبلاوية",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 11
  },
  {
    "name": "النجمية لها وظيفة مناعية بين خلايا الغراء العصبي",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 12
  },
  {
    "name": "فرق الجهد في حالة الاستقطاب هو -70 mV",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 13
  },
  {
    "name": "جذع الدماغ يتكون من 3 أجزاء",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 14
  },
  {
    "name": "الشم ليس من وظائف اللسان",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 15
  },
  {
    "name": "الدهليز مسؤول عن اتزان حركة الجسم في الأذن",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 16
  },
  {
    "name": "الأوكسين يسيطر على الاتزان الأرضي والضوئي",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 17
  },
  {
    "name": "البنكرياس ليس غدة لا قنوية",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 18
  },
  {
    "name": "الجلوكاجون هرمون ببتيدي",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 19
  },
  {
    "name": "العظام متأثرة بهرمون STH",
    "true": "ص",
    "false": "خ",
    "Answer": "ص",
    "unit": "1",
    "index": 20
  }
],[
  {
    "name": "أي مما يلي يمنع ارتجاع الدم في القلب؟",
    "select1": "الأذينين",
    "select2": "البطينين",
    "select3": "الصمامات",
    "select4": "الشرايين",
    "Answer": "الصمامات",
    "unit": "1",
    "index": 12,
    "isCorrect": true
  },
  {
    "name": "تتكون مادة السكري من تكسير مادة ...",
    "select1": "البروتين",
    "select2": "الدهون",
    "select3": "المواد الكربوهيدراتية",
    "select4": "الفيتامينات",
    "Answer": "المواد الكربوهيدراتية",
    "unit": "1",
    "index": 13,
    "isCorrect": true
  },
  {
    "name": "الاحساس بلمس الجلد تتم بواسطة التراكيب الحسية ...",
    "select1": "المكارية",
    "select2": "المغزل",
    "select3": "الكاسات",
    "select4": "العصي والمخاريط",
    "Answer": "المكارية",
    "unit": "1",
    "index": 14,
    "isCorrect": true
  },
  {
    "name": "أي من العصور التالية هو عصر البرمائيات؟",
    "select1": "الترياسي",
    "select2": "البليستوسين",
    "select3": "الكربوني",
    "select4": "الجوراسي",
    "Answer": "الكربوني",
    "unit": "1",
    "index": 15,
    "isCorrect": true
  },
  {
    "name": "أي مما يلي يعد من التكاثر اللاجنسي في الحيوان؟",
    "select1": "الانقسام",
    "select2": "التبرعم",
    "select3": "التحول الشكلي",
    "select4": "التزاوج",
    "Answer": "التبرعم",
    "unit": "1",
    "index": 16,
    "isCorrect": true
  },
  {
    "name": "أي مما يلي يعتبر غذاء الفراخ في الأيام الأولى بعد التفقيس؟",
    "select1": "الاستروجينات",
    "select2": "الدهون",
    "select3": "الهيموجلوبينات",
    "select4": "الزلال",
    "Answer": "الزلال",
    "unit": "1",
    "index": 17,
    "isCorrect": true
  },
  {
    "name": "عدد الكروموسومات للفراولة الأحادية هو ...",
    "select1": "2n",
    "select2": "3n",
    "select3": "4n",
    "select4": "n",
    "Answer": "n",
    "unit": "1",
    "index": 18,
    "isCorrect": true
  },
  {
    "name": "يبقى بعض الاندوسبيرم محاط بالجنين في ...",
    "select1": "الفاصوليا",
    "select2": "الذرة",
    "select3": "القمح",
    "select4": "الفول",
    "Answer": "القمح",
    "unit": "1",
    "index": 19,
    "isCorrect": true
  },
  {
    "name": "كلا مما يأتي من أدوار دورة المبيض ما عدا ...",
    "select1": "الإباضة",
    "select2": "الجسم الأصفر",
    "select3": "التخصيب",
    "select4": "البويضة",
    "Answer": "التخصيب",
    "unit": "1",
    "index": 20,
    "isCorrect": true
  },
  {
    "name": "يمكن حيوان الهيدرا من الحركة في الماء بواسطة ...",
    "select1": "الأميبا",
    "select2": "الزغب",
    "select3": "البراعم",
    "select4": "الديدان",
    "Answer": "البراعم",
    "unit": "1",
    "index": 1,
    "isCorrect": true
  },
  {
    "name": "تطبق البوصة عند سماعه في التلفون ...",
    "select1": "المتوسطة",
    "select2": "الطبلاوية",
    "select3": "الكعبرية",
    "select4": "العلوية",
    "Answer": "الطبلاوية",
    "unit": "1",
    "index": 2,
    "isCorrect": true
  },
  {
    "name": "أحد خلايا الغراء العصبي الآتية له وظيفة مناعية ...",
    "select1": "النجمية",
    "select2": "الدهنية",
    "select3": "المتوسطة",
    "select4": "الطبقية",
    "Answer": "النجمية",
    "unit": "1",
    "index": 3,
    "isCorrect": true
  },
  {
    "name": "مقدار فرق الجهد في حالة الاستقطاب ...",
    "select1": "-50 mV",
    "select2": "-70 mV",
    "select3": "0 mV",
    "select4": "+30 mV",
    "Answer": "-70 mV",
    "unit": "1",
    "index": 4,
    "isCorrect": true
  },
  {
    "name": "يتكون جذع الدماغ من أجزاء عددها ...",
    "select1": "2",
    "select2": "3",
    "select3": "4",
    "select4": "5",
    "Answer": "3",
    "unit": "1",
    "index": 5,
    "isCorrect": true
  },
  {
    "name": "من وظائف اللسان كل مما يأتي عدا ...",
    "select1": "الكلام",
    "select2": "البلع",
    "select3": "التذوق",
    "select4": "الشم",
    "Answer": "الشم",
    "unit": "1",
    "index": 6,
    "isCorrect": true
  },
  {
    "name": "العضو المسؤول عن اتزان حركة الجسم في الأذن ...",
    "select1": "المرقاة",
    "select2": "القوقعة",
    "select3": "الدهليز",
    "select4": "الطبلة",
    "Answer": "الدهليز",
    "unit": "1",
    "index": 7,
    "isCorrect": true
  },
  {
    "name": "هرمون يسيطر على الاتزان الأرضي والضوئي ...",
    "select1": "الأوكسين",
    "select2": "الجبريلين",
    "select3": "السيتوكين",
    "select4": "الفاينيل",
    "Answer": "الأوكسين",
    "unit": "1",
    "index": 8,
    "isCorrect": true
  },
  {
    "name": "كلا مما يأتي غدد لا قنوية ما عدا ...",
    "select1": "الدرقية",
    "select2": "البنكرياس",
    "select3": "الكظرية",
    "select4": "النخامية",
    "Answer": "البنكرياس",
    "unit": "1",
    "index": 9,
    "isCorrect": true
  },
  {
    "name": "أحد الهرمونات الآتية ببتيدي ...",
    "select1": "الكورتيزول",
    "select2": "الجلوكاجون",
    "select3": "الأستروجين",
    "select4": "التستوستيرون",
    "Answer": "الجلوكاجون",
    "unit": "1",
    "index": 10,
    "isCorrect": true
  },
  {
    "name": "العضو المتأثر بهرمون STH هو ...",
    "select1": "المبيض",
    "select2": "الجلد",
    "select3": "العظام",
    "select4": "الخصية",
    "Answer": "العظام",
    "unit": "1",
    "index": 11,
    "isCorrect": true
  },
  {
    "name": "الإحساس بواسطة الشبكة العصبية خاصية تميز حيوان ...",
    "select1": "دودة الأرض",
    "select2": "الأميبا",
    "select3": "البراميسيوم",
    "select4": "الهيدرا",
    "Answer": "الهيدرا",
    "unit": "1",
    "index": 21,
    "isCorrect": true
  },
  {
    "name": "عدد الأعصاب الخارجة من الدماغ يساوي ... زوجاً",
    "select1": "12",
    "select2": "4",
    "select3": "24",
    "select4": "31",
    "Answer": "12",
    "unit": "1",
    "index": 22,
    "isCorrect": true
  },
  {
    "name": "خلايا توجد خارج الجهاز العصبي ...",
    "select1": "النجمية",
    "select2": "الدبقية الصغيرة",
    "select3": "خلايا شوان",
    "select4": "الخلايا القمرية",
    "Answer": "خلايا شوان",
    "unit": "1",
    "index": 23,
    "isCorrect": true
  },
  {
    "name": "عدد الخلايا المخروطية في شبكية العين الواحدة يساوي ... مليون خلية.",
    "select1": "100",
    "select2": "200",
    "select3": "6",
    "select4": "3",
    "Answer": "6",
    "unit": "1",
    "index": 24,
    "isCorrect": true
  },
  {
    "name": "مركز تذوق الطعم الحلو في اللسان يتركز في المنطقة ...",
    "select1": "الخلفية",
    "select2": "الجانبية الخلفية",
    "select3": "الأمامية",
    "select4": "الوسط",
    "Answer": "الأمامية",
    "unit": "1",
    "index": 25,
    "isCorrect": true
  },
  {
    "name": "أي من الأعضاء التالية مسؤول عن ضخ الدم إلى الجسم؟",
    "select1": "الأذين الأيمن",
    "select2": "البطين الأيسر",
    "select3": "الأذين الأيسر",
    "select4": "البطين الأيمن",
    "Answer": "البطين الأيسر",
    "unit": "1",
    "index": 26,
    "isCorrect": true
  },
  {
    "name": "أي من الفيتامينات التالية قابلة للذوبان في الدهون؟",
    "select1": "فيتامين B1",
    "select2": "فيتامين C",
    "select3": "فيتامين A",
    "select4": "فيتامين B12",
    "Answer": "فيتامين A",
    "unit": "1",
    "index": 27,
    "isCorrect": true
  },
  {
    "name": "ما نوع التغذية في النبات الطحالب؟",
    "select1": "ذاتية",
    "select2": "غير ذاتية",
    "select3": "متغايرة",
    "select4": "تطفلية",
    "Answer": "ذاتية",
    "unit": "1",
    "index": 28,
    "isCorrect": true
  },
  {
    "name": "أي من التالي يميز الخلايا العصبية؟",
    "select1": "قادرة على الانقسام السريع",
    "select2": "نقل الإشارات الكهربائية",
    "select3": "تخزين الدهون",
    "select4": "إنتاج الأجسام المضادة",
    "Answer": "نقل الإشارات الكهربائية",
    "unit": "1",
    "index": 29,
    "isCorrect": true
  },
  {
    "name": "أي من الأعضاء التالية يحتوي على صمامات؟",
    "select1": "الشريان الأورطي",
    "select2": "الأوردة",
    "select3": "الشريان الرئوي",
    "select4": "الشريان السباتي",
    "Answer": "الأوردة",
    "unit": "1",
    "index": 30,
    "isCorrect": true
  }
]
]










function intrntQus(){
    console.log(quranA[0],445555)
    console.log("•••••-",materials[0])
    materials[0].portTF = quranA[0]
    materials[0].portSelect = quranA[1]
    
    materials[1].portTF = islamicA[0]
    materials[1].portSelect = islamicA[1]
    
    materials[2].portTF = arabicA[0]
    materials[2].portSelect = arabicA[1]
    
    materials[3].portTF = englishA[0]
    materials[3].portSelect = englishA[1]
    
    materials[4].portTF = physicsA[0]
    materials[4].portSelect = physicsA[1]
    
    materials[5].portTF = chamA[0]
    materials[5].portSelect = chamA[1]
    
    materials[6].portTF = mathA[0]
    materials[6].portSelect = mathA[1]
    
    materials[7].portTF = biologyA[0]
    materials[7].portSelect = biologyA[1]
    
    console.log(materials[7])
    save_data(materials,"materials")
}
let alertZ = `
<div>
    <marquee style="text-align: center;;font-family: 'font1';">
        <div>
                اهلاً وسهلاً بك في تطبيق اختبار
        </div>
        <div style="text-shadow: 0px 3px 5px blue ">
        م/ برهان الدين العذيبي    
        </div>
    </marquee>
</div>
`
function updateAlert(){
    save_data(alertZ,"alert")
}
function systemFunc(){
    intrntQus()
}
setTimeout(function() {updateAlert()}, 2500);
